Revit 2027 API
BuiltInFailures.SiteFailures.GradingInSamePhase Property
 The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GradingInSamePhase { get; }
Public Shared ReadOnly Property GradingInSamePhase As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GradingInSamePhase {
	FailureDefinitionId^ get ();
}
static member GradingInSamePhase : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace